<a href="https://colab.research.google.com/github/Debo12/debo12.pandas-fp/blob/main/pandas_indexing_ipnyb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:
import numpy as np
import pandas as pd

# Single Level Index

In [15]:
df = pd.DataFrame(np.random.rand(5, 2))
df.index = ['row_'+str(i) for i in range(1, 6)]
print(df)

              0         1
row_1  0.558258  0.101283
row_2  0.077910  0.303753
row_3  0.417924  0.385294
row_4  0.714496  0.868379
row_5  0.687499  0.993904

# Date Time Index

In [16]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [17]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [18]:
ufo.Time.str.slice(-5, -3).astype(int).head()

0    22
1    20
2    14
3    13
4    19
Name: Time, dtype: int64

In [19]:
ufo['Time'] = pd.to_datetime(ufo.Time)

In [20]:
ufo.head()

                   City Colors Reported  ... State                Time
0                Ithaca             NaN  ...    NY 1930-06-01 22:00:00
1           Willingboro             NaN  ...    NJ 1930-06-30 20:00:00
2               Holyoke             NaN  ...    CO 1931-02-15 14:00:00
3               Abilene             NaN  ...    KS 1931-06-01 13:00:00
4  New York Worlds Fair             NaN  ...    NY 1933-04-18 19:00:00

[5 rows x 5 columns]

In [21]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [22]:
ufo.Time.dt.day_name()

0         Sunday
1         Monday
2         Sunday
3         Monday
4        Tuesday
          ...
18236     Sunday
18237     Sunday
18238     Sunday
18239     Sunday
18240     Sunday
Name: Time, Length: 18241, dtype: object

In [23]:
ts = pd.to_datetime('1/2/1999')
print(ts)

1999-01-02 00:00:00

In [24]:
ufo.loc[ufo.Time >= ts, :].head()

               City Colors Reported Shape Reported State                Time
12843       Seattle           GREEN          LIGHT    WA 1999-01-02 17:42:00
12844     Vancouver           GREEN       FIREBALL    WA 1999-01-02 18:30:00
12845   Spirit Lake       RED GREEN          LIGHT    ID 1999-01-02 20:00:00
12846  Jacksonville        RED BLUE          OTHER    FL 1999-01-02 20:30:00
12847    Marysville       RED GREEN         SPHERE    CA 1999-01-02 22:12:00

In [25]:
(ufo.Time.max()-ufo.Time.min()).days

25781

# Hierarchical Index

In [26]:
raw_data = {
    'city': ['Tripoli', 'Tripoli', 'Rome', 'Rome', 'Sydney', 'Sydney'],
    'rank': ['1st','2nd','1st','2nd','1st','2nd'],
    'name': ['Noureddin','Adam','Kevin','Raihana','Raghad','Mahdi'],
    'score1': [44,48,39,41,39,44],
    'score2': [67,63,55,70,64,77]
}

In [32]:
df = pd.DataFrame(raw_data, columns=['city', 'rank', 'name', 'score1', 'score2'])
df

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd    Raihana      41      70
4   Sydney  1st     Raghad      39      64
5   Sydney  2nd      Mahdi      44      77

In [35]:
df.set_index(['city', 'rank'])

                   name  score1  score2
city    rank
Tripoli 1st   Noureddin      44      67
        2nd        Adam      48      63
Rome    1st       Kevin      39      55
        2nd     Raihana      41      70
Sydney  1st      Raghad      39      64
        2nd       Mahdi      44      77

In [36]:
df.set_index(['city', 'rank'], drop=True, inplace=True)

In [37]:
df

                   name  score1  score2
city    rank
Tripoli 1st   Noureddin      44      67
        2nd        Adam      48      63
Rome    1st       Kevin      39      55
        2nd     Raihana      41      70
Sydney  1st      Raghad      39      64
        2nd       Mahdi      44      77

In [38]:
df.index

MultiIndex([('Tripoli', '1st'),
            ('Tripoli', '2nd'),
            (   'Rome', '1st'),
            (   'Rome', '2nd'),
            ( 'Sydney', '1st'),
            ( 'Sydney', '2nd')],
           names=['city', 'rank'])

# Test

In [39]:
d = pd.date_range('11-Sep-2017', '17-Sep-2017', freq='2D')
len(d[d.isin(pd.to_datetime(['12-09-2017', '15-09-2017']))])

1

In [41]:
len(pd.period_range('11-Sep-2017', '17-Sep-2017', freq='M'))

1

In [42]:
d = pd.date_range('11-Sep-2017', '17-Sep-2017', freq='2D')
d + pd.Timedelta('1 days 2 hours')
d

DatetimeIndex(['2017-09-11', '2017-09-13', '2017-09-15', '2017-09-17'], dtype='datetime64[ns]', freq='2D')